In [11]:
import pandas as pd
import numpy as np

In [16]:
df = pd.DataFrame({"Gruplar":["A","B","C","A","B","C"],
                  "Veriler":[1,2,3,12,43,23],"Veriler2":[13,42,23,43,23,15]},columns=["Gruplar","Veriler","Veriler2"])
df

  Gruplar  Veriler  Veriler2
0       A        1        13
1       B        2        42
2       C        3        23
3       A       12        43
4       B       43        23
5       C       23        15

In [9]:
df.groupby("Gruplar").sum()

         Veriler
Gruplar
A             13
B             45
C             26

In [15]:
df.groupby("Gruplar").aggregate(["min",np.median,max])

        Veriler
            min median max
Gruplar
A             1    6.5  12
B             2   22.5  43
C             3   13.0  23

In [30]:
def funcmerci(x):
    return x["Veriler2"].std()<17

In [29]:
df.groupby("Gruplar").filter(funcmerci)

  Gruplar  Veriler  Veriler2
1       B        2        42
2       C        3        23
4       B       43        23
5       C       23        15

In [32]:
df.groupby("Gruplar").std()

           Veriler   Veriler2
Gruplar
A         7.778175  21.213203
B        28.991378  13.435029
C        14.142136   5.656854

In [33]:
df["Veriler"]*9

0      9
1     18
2     27
3    108
4    387
5    207
Name: Veriler, dtype: int64

In [34]:
df.transform(lambda x: x-x.mean())

C:\Users\meric\AppData\Local\Temp\ipykernel_19184\3234624938.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.transform(lambda x: x-x.mean())

  Gruplar  Veriler  Veriler2
0     NaN    -13.0     -13.5
1     NaN    -12.0      15.5
2     NaN    -11.0      -3.5
3     NaN     -2.0      16.5
4     NaN     29.0      -3.5
5     NaN      9.0     -11.5

In [38]:
df_a=df.iloc[:,1:3] 
df_a.transform(lambda x: x-x.mean()/x.std())

     Veriler   Veriler2
0   0.151125  10.969334
1   1.151125  39.969334
2   2.151125  20.969334
3  11.151125  40.969334
4  42.151125  20.969334
5  22.151125  12.969334

In [40]:
df.apply(np.sum)

Gruplar     ABCABC
Veriler         84
Veriler2       159
dtype: object

In [42]:
df.groupby("Gruplar").apply(np.sum)

        Gruplar  Veriler  Veriler2
Gruplar
A            AA       13        56
B            BB       45        65
C            CC       26        38